import pygame
from pygame.draw import *
# После импорта библиотеки, необходимо её инициализировать:
pygame.init()

# И создать окно:
screen = pygame.display.set_mode((600, 800), pygame.DOUBLEBUF, 32)

# здесь будут рисоваться фигуры
# ...

rect(screen, (1,1,54), (0, 0, 600, 500))
rect(screen, (1,54,6), (0, 500, 600, 300))
circle(screen, (255, 255, 255), (430, 200), 100)
ellipse(screen, (60,60,60), (-150, 20, 500, 200))
ellipse(screen, (60,60,60), (150, 200, 300, 130))
ellipse(screen, (60,60,60), (400, 10, 400, 150))
ellipse(screen, (100,100,100), (200, -10, 400, 100))
ellipse(screen, (100,100,100), (40, 130, 350, 90))

polygon(screen, (246, 247, 206, 50), [(150, 350), (250, 610), (50, 610)])

ellipse(screen, (178,178,178), (30, 350, 240, 80))
ellipse(screen, (228,228,228), (70, 340, 160, 60))

# circle(screen, (250,250,0), (200, 200), 100)
# circle(screen, (250,0,0), (170, 200), 20)
# circle(screen, (250,0,0), (230, 200), 20)
# circle(screen, (0,0,0), (170, 200), 10)
# circle(screen, (0,0,0), (230, 200), 10)
# rect(screen, (0,0,0), (160, 250, 80, 20))
# polygon(screen, (0,0,0), [(210, 170), (215, 180), (275, 160), (270, 150)])
# polygon(screen, (0,0,0), [(215-80, 150), (210-80, 160), (270-80, 180), (275-80, 170)])

# после чего, чтобы они отобразились на экране, экран нужно обновить:
pygame.display.update()
# Эту же команду нужно будет повторять, если на экране происходят изменения.

# Наконец, нужно создать основной цикл, в котором будут отслеживаться
# происходящие события.
# Пока единственное событие, которое нас интересует - выход из программы.
while True:
    for event in pygame.event.get():
        if event.type == pygame.QUIT:
            pygame.quit()